In [ ]:
#series -> 1D
#dataframe -> 2D
#panel -> ND
#pandas -> panel + Data

In [1]:
import numpy as np
import pandas as pd

import warnings
warnings.filterwarnings("ignore")

In [2]:
pd.Series()

Series([], dtype: float64)

In [3]:
names = ["jay", "kumar", "suraj", "raj", "mithilesh"]

s = pd.Series(names)

In [4]:
s

0          jay
1        kumar
2        suraj
3          raj
4    mithilesh
dtype: object

In [5]:
s[2]

'suraj'

In [6]:
pd.Series(data=names, index=["a", "b", "c", "d", "e"])

a          jay
b        kumar
c        suraj
d          raj
e    mithilesh
dtype: object

In [7]:
d ={
    "a":"jay",
    "b": "kumar",
    "c": "suraj",
    "d": "raj",
    "e": "mithilesh"
}


pd.Series(d)

a          jay
b        kumar
c        suraj
d          raj
e    mithilesh
dtype: object

In [8]:
pd.Series(5, index= ["a", "b", "c", "d", "e"])

a    5
b    5
c    5
d    5
e    5
dtype: int64

In [9]:
pd.DataFrame()

Empty DataFrame
Columns: []
Index: []

In [10]:
pd.DataFrame(names)

           0
0        jay
1      kumar
2      suraj
3        raj
4  mithilesh

In [11]:
d = [
    ["jay", 89, 25],
     ["kumar", 48, 89],
     ["pratik", 30, 20],
     ["suraj", 89, 90],
     ["raj", 90, 95]
]

colname = ["Name", "Python", "Machine Learning"]
df = pd.DataFrame(d, columns=colname)

In [12]:
df

     Name  Python  Machine Learning
0     jay      89                25
1   kumar      48                89
2  pratik      30                20
3   suraj      89                90
4     raj      90                95

In [13]:
d = {
    "Name": ["jay", "kumar", "pratik", "suraj", "raj"],
     "Python": [89, 48, 30, 89, 90],
     "Machine Learning": [25, 89, 20, 90, 95]
}

pd.DataFrame(d)

     Name  Python  Machine Learning
0     jay      89                25
1   kumar      48                89
2  pratik      30                20
3   suraj      89                90
4     raj      90                95

In [14]:
d = np.random.randn(10, 4)
df = pd.DataFrame(d, columns=["A", "B", "C", "D"])
df

          A         B         C         D
0  0.405373  0.367108  0.885031 -1.995556
1 -1.008192  0.507749  0.275206 -0.384703
2 -0.993949  0.215673  0.515289  1.745132
3  0.513672 -0.059410  2.511034  1.118735
4  0.007581 -0.118773  1.273525 -2.217770
5  1.568017  0.000401  1.273165  1.802686
6  1.544785  0.004626 -0.217833 -1.054947
7 -1.750265  0.792858  0.139663 -0.800647
8 -0.036932  1.088193  0.621955 -0.659515
9 -0.455045  0.288451  0.100093 -1.265914

In [15]:
#df.to_csv("randomdata.csv", index=False)

In [16]:
#tsv 
#csv
#excel
#json
#unknown

In [17]:
df = pd.read_table("chiporders.tsv")

In [18]:
df.head(8)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98
6,3,1,Side of Chips,NaN,$1.69
7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$11.75

In [ ]:
df.tail(8)

In [ ]:
df.sample(5)

In [ ]:
pd.read_table("drinks.csv", sep=",").head()

In [ ]:
pd.read_csv("drinks.csv").head()

In [ ]:
!pip install xlrd

In [ ]:
!pip install openpyxl

In [ ]:
pd.read_excel("exbook.xlsx", sheet_name="Sheet1")

In [ ]:
path = "https://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.data"

colname = ["sepal length", "sepal width", "petal length", "petal width", "class"]

pd.read_table(path, sep=",", header=None, names=colname)

In [ ]:
colname = ["ID","Age", "Gender", "occupation", "zipcode"]
pd.read_table("psd.user", sep="|", header=None, names=colname)

In [ ]:
pd.read_json("simple.json")

In [ ]:
pd.read_json("simple_records.json", lines=True)

In [ ]:
df = pd.read_csv("movies.csv")
df.head()

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."

In [ ]:
df.shape

(979, 6)

In [ ]:
df.dtypes

star_rating       float64
title              object
content_rating     object
genre              object
duration            int64
actors_list        object
dtype: object

In [ ]:
df.columns

Index(['star_rating', 'title', 'content_rating', 'genre', 'duration',
       'actors_list'],
      dtype='object')

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 979 entries, 0 to 978
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   star_rating     979 non-null    float64
 1   title           979 non-null    object
 2   content_rating  976 non-null    object
 3   genre           979 non-null    object
 4   duration        979 non-null    int64
 5   actors_list     979 non-null    object
dtypes: float64(1), int64(1), object(4)
memory usage: 46.0+ KB

In [ ]:
#from the given data we can say that,
#The dataset has 979 row and 6 columns
#Most of the columns has object datatype which is an arbitary datatype which represents a collections
#there are few columns with int & float type as well
#also in content rating column there are 3 missing values

In [ ]:
df.head()

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."

In [ ]:
# dot notation
# bracket notation

In [ ]:
df.duration

0      142
1      175
2      200
3      152
4      154
      ...
974    116
975    118
976    138
977    114
978    126
Name: duration, Length: 979, dtype: int64

In [ ]:
df.shape

(979, 6)

In [ ]:
df["duration"]

0      142
1      175
2      200
3      152
4      154
      ...
974    116
975    118
976    138
977    114
978    126
Name: duration, Length: 979, dtype: int64

In [ ]:
df["duration"].mean()

120.97957099080695

In [ ]:
df["duration"].median()

117.0

In [ ]:
df["duration"].mode()

0    112
dtype: int64

In [ ]:
df["duration"].std()

26.218009846412073

In [ ]:
df.describe()

       star_rating    duration
count   979.000000  979.000000
mean      7.889785  120.979571
std       0.336069   26.218010
min       7.400000   64.000000
25%       7.600000  102.000000
50%       7.800000  117.000000
75%       8.100000  134.000000
max       9.300000  242.000000

In [ ]:
#There are overall 979 samples in the dataset
#The avg of star rating is concentrated around 7.8 i.e overall the user are satisfied with movies.
#the avg star rating may vary between 7.5 - 8.1
#the star ratings ranges between 7.4 - 9.3
#star rating exhibits -ve skewness since, median is greater then mean
#50% star rating is below 7.8 and rest above it